#include <iostream>
#include <Windows.h>

using namespace std;

int main(void) {
	/**********************************<练习一>********************************/
	/*20个硬币加起来等于10块钱(1000分钱), 共有多少种方案?*/

	int a100 = 0;//钱币数量, 1块钱, 100分钱
	int a50 = 0;//钱币数量, 5毛钱, 50分钱
	int a10 = 0;//钱币数量, 1毛钱, 10分钱
	int a5 = 0;//钱币数量, 5分钱
	int cut = 0;//方案数量

	for (a100 = 0; a100 <= 10; a100++) {
		for (a50 = 0; a50 <= 20 - a100; a50++) {
			for (a10 = 0; a10 <= 20 - a100 - a50; a10++) {
				for (a5 = 0; a5 <= 20 - a100 - a50 - a10; a5++) {
					if ((a100 * 100 + a50 * 50 + a10 * 10 + a5 * 5) == 1000 && (a100 + a50 + a10 + a5) == 20) {
						cout << a100 << ", " << a50 << ", " << a10 << ", " << a5 << "\n";
						cut++;
					}
				}
			}
		}
	}
	cout << "一共有: " << cut << "种方案!\n";

	/**********************************<练习二>********************************/
	/*百钱买百鸡: 1只公鸡5块钱, 1只母鸡3块钱, 3只小鸡1块钱*/

	int cock = 0;//公鸡数量
	int hen = 0;//母鸡数量
	int chick = 0;//小鸡数量
	int cut1 = 0;

	for (cock = 0; cock <= 100 / 5; cock++) {
		for (hen = 0; hen <= 100 / 3; hen++) {
			for (chick = 0; chick <= 100 / 1; chick += 3) {
				if ((cock*5 + hen*3 + chick/3) == 100 && (cock + hen + chick) == 100) {
					cout << cock << ", " << hen << ", " << chick << "\n";
					cut1++;
				}
			}
		}
	}
	cout << "一共有" << cut1 << "种方案!\n";

	system("pause");
	return 0;
}